In [1]:

import numpy as np
import pandas as pd

In [2]:
sales = [5, 23, 89, 45, 61]
sales_series = pd.Series(sales, name='Sales')
sales_series

0     5
1    23
2    89
3    45
4    61
Name: Sales, dtype: int64

In [3]:
print(sales_series.index)
print(sales_series.values)
print(sales_series.name)
print(sales_series.dtype)

RangeIndex(start=0, stop=5, step=1)
[ 5 23 89 45 61]
Sales
int64

In [4]:
sales_series.astype('float64')

0     5.0
1    23.0
2    89.0
3    45.0
4    61.0
Name: Sales, dtype: float64

In [5]:
sales_series.astype('bool')

0    True
1    True
2    True
3    True
4    True
Name: Sales, dtype: bool

In [7]:
sales_series.astype('datetime64[ns]')

0   1970-01-01 00:00:00.000000005
1   1970-01-01 00:00:00.000000023
2   1970-01-01 00:00:00.000000089
3   1970-01-01 00:00:00.000000045
4   1970-01-01 00:00:00.000000061
Name: Sales, dtype: datetime64[ns]

Series Indexing

In [8]:
sales_series[2]

89

In [9]:
sales_series[2:4]

2    89
3    45
Name: Sales, dtype: int64

In [10]:
weekday = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri']
sales_series = pd.Series(sales, index=weekday, name='Sales')
sales_series

Mon     5
Tue    23
Wed    89
Thu    45
Fri    61
Name: Sales, dtype: int64

In [11]:
sales_series

Mon     5
Tue    23
Wed    89
Thu    45
Fri    61
Name: Sales, dtype: int64

In [12]:
sales_series['Wed']

89

In [13]:
sales_series['Tue':'Thu']

Tue    23
Wed    89
Thu    45
Name: Sales, dtype: int64

In [15]:
sales_series.iloc[2]

89

In [16]:
sales_series.iloc[1:4]

Tue    23
Wed    89
Thu    45
Name: Sales, dtype: int64

In [17]:
sales_series.loc['Tue']

23

In [18]:
sales_series.loc['Wed':'Fri']

Wed    89
Thu    45
Fri    61
Name: Sales, dtype: int64

In [19]:
sales = [5, 23, 89, 45, 61]
items = ['Pencil', 'Pen', 'Eraser', 'Notebook', 'Pen']

sales_series = pd.Series(sales, index=items, name='Sales')
sales_series

Pencil       5
Pen         23
Eraser      89
Notebook    45
Pen         61
Name: Sales, dtype: int64

In [20]:
sales_series.loc['Pen']

Pen    23
Pen    61
Name: Sales, dtype: int64

In [21]:
sales_series.reset_index()

      index  Sales
0    Pencil      5
1       Pen     23
2    Eraser     89
3  Notebook     45
4       Pen     61

In [22]:
sales_series.reset_index(drop=True)

0     5
1    23
2    89
3    45
4    61
Name: Sales, dtype: int64

# Task - 1
# find out the first and last 5 days average oil consumption
# find out only January, 2017 average oil consumption

In [29]:
oil_consumption = pd.read_csv('oil.csv', index_col='date', parse_dates=True)

# First 5 days' average oil price
first_5_days_avg = oil_consumption.head(5)['dcoilwtico'].mean()


first_5_days_avg

93.1075

In [28]:
# last 5 days' average oil price
last_5_days_avg = oil_consumption.tail(5)['dcoilwtico'].mean()


last_5_days_avg

46.745999999999995

In [30]:
# Average oil price for January 2017
january_2017_avg = oil_consumption['dcoilwtico'].mean()

january_2017_avg

67.71436595744682

In [31]:
oil_consumption = pd.read_csv('oil.csv', index_col='date', parse_dates=True)
oil_consumption.head()

            dcoilwtico
date
2013-01-01         NaN
2013-01-02       93.14
2013-01-03       92.97
2013-01-04       93.12
2013-01-07       93.20

In [32]:
oil_consumption.iloc[:5].mean()

dcoilwtico    93.1075
dtype: float64

In [33]:
oil_consumption.iloc[-5:].mean()

dcoilwtico    46.746
dtype: float64

In [34]:
oil_consumption.loc['2017-01']

            dcoilwtico
date
2017-01-02         NaN
2017-01-03       52.36
2017-01-04       53.26
2017-01-05       53.77
2017-01-06       53.98
2017-01-09       51.95
2017-01-10       50.82
2017-01-11       52.19
2017-01-12       53.01
2017-01-13       52.36
2017-01-16         NaN
2017-01-17       52.45
2017-01-18       51.12
2017-01-19       51.39
2017-01-20       52.33
2017-01-23       52.77
2017-01-24       52.38
2017-01-25       52.14
2017-01-26       53.24
2017-01-27       53.18
2017-01-30       52.63
2017-01-31       52.75

In [35]:
oil_consumption.loc['2017-01-01': '2017-01-31'].mean()

dcoilwtico    52.504
dtype: float64

Series Filtering

In [36]:
sales_series

Pencil       5
Pen         23
Eraser      89
Notebook    45
Pen         61
Name: Sales, dtype: int64

In [37]:
sales_series.loc[sales_series > 30 ]

Eraser      89
Notebook    45
Pen         61
Name: Sales, dtype: int64

In [38]:
mask = (sales_series > 30) & (sales_series.index == 'Pen')
sales_series[mask]

Pen    61
Name: Sales, dtype: int64

In [39]:
# python operator
sales_series == 5

# pandas method
sales_series.eq(5)

Pencil       True
Pen         False
Eraser      False
Notebook    False
Pen         False
Name: Sales, dtype: bool

In [40]:
sales_series.index.isin(['Pen', 'Eraser'])

array([False,  True,  True, False,  True])

In [41]:
~sales_series.index.isin(['Pen', 'Eraser'])

array([ True, False, False,  True, False])

Sorting series

In [42]:
sales_series.sort_values()

Pencil       5
Pen         23
Notebook    45
Pen         61
Eraser      89
Name: Sales, dtype: int64

In [43]:
sales_series.sort_values(ascending=False)

Eraser      89
Pen         61
Notebook    45
Pen         23
Pencil       5
Name: Sales, dtype: int64

In [44]:
sales_series.sort_index()

Eraser      89
Notebook    45
Pen         23
Pen         61
Pencil       5
Name: Sales, dtype: int64

In [45]:
sales_series.sort_index(ascending=False)

Pencil       5
Pen         23
Pen         61
Notebook    45
Eraser      89
Name: Sales, dtype: int64

# Task
First, can you get me the 10 lowest prices from the data, sorted by date, starting with the most recent and ending with the oldest?
After that, return to the original data. I’ve provided a list of dates I want to narrow down to, and I also want to look only at prices less than or equal to 50 dollars per barrel.

In [47]:
# Assuming 'oil_consumption' is your DataFrame with a 'price' column
# oil_consumption = pd.read_csv('oil.csv', index_col='date', parse_dates=True)

# Sort the DataFrame by date and get the 10 lowest prices
lowest_prices = oil_consumption.sort_values(by='date', ascending=False).head(10)

# Print the result
print("10 Lowest Prices (sorted by date):")
print(lowest_prices)

10 Lowest Prices (sorted by date):
            dcoilwtico
date
2017-08-31       47.26
2017-08-30       45.96
2017-08-29       46.46
2017-08-28       46.40
2017-08-25       47.65
2017-08-24       47.24
2017-08-23       48.45
2017-08-22       47.65
2017-08-21       47.39
2017-08-18       48.59

In [48]:
# List of dates to narrow down to
selected_dates = ['2023-01-01', '2023-02-01', '2023-03-01']

# Filter the original data based on dates and prices
filtered_data = oil_consumption[(oil_consumption.index.isin(selected_dates)) & (oil_consumption['dcoilwtico'] <= 50)]

# Print the filtered data
print("\nFiltered Data:")
print(filtered_data)

Filtered Data:
Empty DataFrame
Columns: [dcoilwtico]
Index: []

In [49]:
oil_consumption.sort_values(by='dcoilwtico')[:10].sort_index(ascending=False)

            dcoilwtico
date
2016-02-16       29.05
2016-02-12       29.32
2016-02-11       26.19
2016-02-10       27.54
2016-02-09       27.96
2016-01-26       29.54
2016-01-21       29.55
2016-01-20       26.68
2016-01-19       28.47
2016-01-15       29.45

In [50]:
sales_series

Pencil       5
Pen         23
Eraser      89
Notebook    45
Pen         61
Name: Sales, dtype: int64

In [51]:
sales_series + 2

Pencil       7
Pen         25
Eraser      91
Notebook    47
Pen         63
Name: Sales, dtype: int64

In [52]:
sales_series.add(2)

Pencil       7
Pen         25
Eraser      91
Notebook    47
Pen         63
Name: Sales, dtype: int64

In [53]:
"$" + sales_series.astype('float64').astype('str')

Pencil       $5.0
Pen         $23.0
Eraser      $89.0
Notebook    $45.0
Pen         $61.0
Name: Sales, dtype: object

In [54]:
sales_series_update = "$" + sales_series.astype('float64').astype('str')
sales_series_update

Pencil       $5.0
Pen         $23.0
Eraser      $89.0
Notebook    $45.0
Pen         $61.0
Name: Sales, dtype: object

In [55]:
sales_series_update.str.contains('8')

Pencil      False
Pen         False
Eraser       True
Notebook    False
Pen         False
Name: Sales, dtype: bool

In [56]:
sales_series_update.str.replace('$', '', ).astype('float64').astype('int64')

Pencil       5
Pen         23
Eraser      89
Notebook    45
Pen         61
Name: Sales, dtype: int64

In [57]:
sales_series

Pencil       5
Pen         23
Eraser      89
Notebook    45
Pen         61
Name: Sales, dtype: int64

In [58]:
sales_series.sum()

223

In [59]:
sales_series.loc["Pen"].sum()

84

In [60]:
sales_series

Pencil       5
Pen         23
Eraser      89
Notebook    45
Pen         61
Name: Sales, dtype: int64

In [61]:
sales_series_update = sales_series.reset_index()
sales_series_update

      index  Sales
0    Pencil      5
1       Pen     23
2    Eraser     89
3  Notebook     45
4       Pen     61

In [62]:
sales_series_update['index'].value_counts()

index
Pen         2
Pencil      1
Eraser      1
Notebook    1
Name: count, dtype: int64

In [63]:
sales_series_update['index'].unique()

array(['Pencil', 'Pen', 'Eraser', 'Notebook'], dtype=object)

In [64]:
sales_series_update.value_counts(normalize=True)

index     Sales
Eraser    89       0.2
Notebook  45       0.2
Pen       23       0.2
          61       0.2
Pencil    5        0.2
Name: proportion, dtype: float64

In [65]:
sales_series_update['index'].value_counts(normalize=True)

index
Pen         0.4
Pencil      0.2
Eraser      0.2
Notebook    0.2
Name: proportion, dtype: float64

# Missing Data

# Task # oil prices series

In [66]:
import pandas as pd

# Assuming df is your DataFrame with a column named "price"
# Fill in missing values with NaN for demonstration purposes
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05'],
        'price': [50.0, 51.44, 47.83, np.nan, np.nan]}
df = pd.DataFrame(data)

# Count the number of missing values in the "price" column
missing_values_count = df['price'].isnull().sum()
print(f"Number of missing values in the 'price' column: {missing_values_count}")

# Fill missing values with the median of the "price" column
median_price = df['price'].median()
df['price'].fillna(median_price, inplace=True)

# Display the DataFrame after filling missing values
print("DataFrame after filling missing values:")
print(df)

Number of missing values in the 'price' column: 2
DataFrame after filling missing values:
         date  price
0  2022-01-01  50.00
1  2022-01-02  51.44
2  2022-01-03  47.83
3  2022-01-04  50.00
4  2022-01-05  50.00

In [68]:
import pandas as pd
oil_series = pd.read_csv('oil.csv', index_col='date', parse_dates=True)
oil_series = oil_series['dcoilwtico']
oil_series

date
2013-01-01      NaN
2013-01-02    93.14
2013-01-03    92.97
2013-01-04    93.12
2013-01-07    93.20
              ...
2017-08-25    47.65
2017-08-28    46.40
2017-08-29    46.46
2017-08-30    45.96
2017-08-31    47.26
Name: dcoilwtico, Length: 1218, dtype: float64

In [69]:
oil_series = oil_series.where(~oil_series.isin([51.44, 47.83]), pd.NA)
oil_series.isna().sum()

45

In [70]:
oil_series = oil_series.fillna(oil_series.median())
oil_series.isna().sum()

0

# Task

In [71]:
import pandas as pd
import numpy as np

# Assuming df is your DataFrame with a column named "price"
# Fill in missing values with NaN for demonstration purposes
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05'],
        'price': [50.0, 51.44, 47.83, np.nan, np.nan]}
df = pd.DataFrame(data)

def buy_or_wait(price):
    percentile_90 = np.percentile(df['price'].dropna(), 90)
    
    if price < percentile_90:
        return 'buy'
    else:
        return 'wait'

# Apply the function to the oil price series
df['buy_or_wait'] = df['price'].apply(buy_or_wait)

# Display the DataFrame after applying the 'buy_or_wait' function
print("DataFrame after applying 'buy_or_wait' function:")
print(df)

# Fix final prices based on the given conditions
df['fixed_price'] = np.where((df['date'] == '2016-12-23') | (df['date'] == '2017-05-10'), df['price'] * 0.55, df['price'] * 1.1)

# Display the DataFrame after fixing final prices
print("DataFrame after fixing final prices:")
print(df)

DataFrame after applying 'buy_or_wait' function:
         date  price buy_or_wait
0  2022-01-01  50.00         buy
1  2022-01-02  51.44        wait
2  2022-01-03  47.83         buy
3  2022-01-04    NaN        wait
4  2022-01-05    NaN        wait
DataFrame after fixing final prices:
         date  price buy_or_wait  fixed_price
0  2022-01-01  50.00         buy       55.000
1  2022-01-02  51.44        wait       56.584
2  2022-01-03  47.83         buy       52.613
3  2022-01-04    NaN        wait          NaN
4  2022-01-05    NaN        wait          NaN

In [72]:
oil_series.apply(lambda x: 'Buy' if x < oil_series.quantile(0.75) else 'Wait').head(20)

date
2013-01-01     Buy
2013-01-02     Buy
2013-01-03     Buy
2013-01-04     Buy
2013-01-07     Buy
2013-01-08     Buy
2013-01-09     Buy
2013-01-10     Buy
2013-01-11     Buy
2013-01-14     Buy
2013-01-15     Buy
2013-01-16     Buy
2013-01-17    Wait
2013-01-18    Wait
2013-01-21     Buy
2013-01-22    Wait
2013-01-23     Buy
2013-01-24    Wait
2013-01-25     Buy
2013-01-28    Wait
Name: dcoilwtico, dtype: object

In [73]:
import numpy as np

In [74]:
pd.Series(
    np.where(
        oil_series.index.isin(['2016-12-23', '2017-05-10']),
        oil_series * 0.9,
        oil_series * 1.1
    )
)

0        58.509
1       102.454
2       102.267
3       102.432
4       102.520
         ...
1213     52.415
1214     51.040
1215     51.106
1216     50.556
1217     51.986
Length: 1218, dtype: float64

In [75]:
oil_series

date
2013-01-01    53.19
2013-01-02    93.14
2013-01-03    92.97
2013-01-04    93.12
2013-01-07    93.20
              ...
2017-08-25    47.65
2017-08-28    46.40
2017-08-29    46.46
2017-08-30    45.96
2017-08-31    47.26
Name: dcoilwtico, Length: 1218, dtype: float64

# DataFrame

In [76]:
import numpy as np
import pandas as pd

In [77]:
retail_df = pd.read_csv('retail_2016_2017.csv')
retail_df

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

# Task

In [78]:
import pandas as pd

# Read the transactions data from the CSV file
file_path = 'transactions.csv'
df = pd.read_csv(file_path)

# Display the number of rows in the data
num_rows = len(df)
print(f"Number of rows in the data: {num_rows}")

# Display the columns and their datatypes
print("\nColumns and their datatypes:")
print(df.dtypes)

Number of rows in the data: 83488

Columns and their datatypes:
date            object
store_nbr        int64
transactions     int64
dtype: object

In [ ]:
transaction_df = pd.read_csv('transactions.csv')
transaction_df

In [80]:
transaction_df.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

# Exploring a DataFrame

# Task

In [81]:
import pandas as pd

# Read the transactions data from the CSV file
file_path = 'transactions.csv'
df = pd.read_csv(file_path)

# Check for missing values in each column
missing_values = df.isnull().sum()

# Display the columns with missing values and their counts
columns_with_missing_values = missing_values[missing_values > 0]
if not columns_with_missing_values.empty:
    print("Columns with missing values:")
    print(columns_with_missing_values)
else:
    print("No missing values found in any column.")

No missing values found in any column.

In [82]:
import pandas as pd

# Read the transactions data from the CSV file
file_path = 'transactions.csv'
df = pd.read_csv(file_path)

# Convert the 'date' column to datetime format
df['date'] = pd.to_datetime(df['date'], errors='coerce')

# Check the number of unique dates and identify any missing dates
unique_dates = df['date'].unique()
missing_dates = pd.date_range(start=df['date'].min(), end=df['date'].max()).difference(unique_dates)

# Display the number of unique dates and any missing dates
print(f"Number of unique dates: {len(unique_dates)}")
if not missing_dates.empty:
    print("Missing dates:")
    print(missing_dates)
else:
    print("No missing dates found.")

Number of unique dates: 1682
Missing dates:
DatetimeIndex(['2013-12-25', '2014-12-25', '2015-12-25', '2016-01-01',
               '2016-01-03', '2016-12-25'],
              dtype='datetime64[ns]', freq=None)

In [83]:
import pandas as pd

# Read the transactions data from the CSV file
file_path = 'transactions.csv'
df = pd.read_csv(file_path)

# Check statistics for the "transactions" column
transactions_stats = df['transactions'].describe()

# Extract specific statistics
mean_transactions = transactions_stats['mean']
median_transactions = df['transactions'].median()
min_transactions = transactions_stats['min']
max_transactions = transactions_stats['max']

# Display the statistics
print(f"Mean transactions: {mean_transactions}")
print(f"Median transactions: {median_transactions}")
print(f"Minimum transactions: {min_transactions}")
print(f"Maximum transactions: {max_transactions}")

Mean transactions: 1694.6021583940208
Median transactions: 1393.0
Minimum transactions: 5.0
Maximum transactions: 8359.0

In [84]:
transaction_df.describe(include='all').round(2)

              date  store_nbr  transactions
count        83488   83488.00      83488.00
unique        1682        NaN           NaN
top     2017-08-15        NaN           NaN
freq            54        NaN           NaN
mean           NaN      26.94       1694.60
std            NaN      15.61        963.29
min            NaN       1.00          5.00
25%            NaN      13.00       1046.00
50%            NaN      27.00       1393.00
75%            NaN      40.00       2079.00
max            NaN      54.00       8359.00

In [85]:
transaction_df.columns = ["date", "store number", "transactions"]
transaction_df.head()

         date  store number  transactions
0  2013-01-01            25           770
1  2013-01-02             1          2111
2  2013-01-02             2          2358
3  2013-01-02             3          3487
4  2013-01-02             4          1922

In [86]:
# transaction_df.store_number
transaction_df["store number"]

0        25
1         1
2         2
3         3
4         4
         ..
83483    50
83484    51
83485    52
83486    53
83487    54
Name: store number, Length: 83488, dtype: int64

Accessing DataFrame

In [87]:
transaction_df = pd.read_csv('transactions.csv')
transaction_df

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

# Task

In [88]:
import pandas as pd

# Read the transactions data from the CSV file
file_path = 'transactions.csv'
df = pd.read_csv(file_path)

# Exclude the first row and select only 'store_nbr' and 'transactions' columns
new_df = df.iloc[1:, :][['store_nbr', 'transactions']].copy()

# Report the number of unique store numbers
unique_store_numbers = new_df['store_nbr'].nunique()

# Report the total number of transactions in millions
total_transactions_millions = new_df['transactions'].sum() / 1e6

# Display the new DataFrame, number of unique store numbers, and total transactions in millions
print("DataFrame excluding the first row and including 'store_nbr' and 'transactions':")
print(new_df)

print(f"\nNumber of unique store numbers: {unique_store_numbers}")

print(f"Total number of transactions in millions: {total_transactions_millions:.2f} million")

DataFrame excluding the first row and including 'store_nbr' and 'transactions':
       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

Number of unique store numbers: 54
Total number of transactions in millions: 141.48 million

In [89]:
transaction_df.loc[1:, ["store_nbr", "transactions"]]

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [90]:
transaction_df["store_nbr"].nunique()

54

In [91]:
transaction_df["transactions"].sum()

141478945

# Dropping Data

# Task

In [98]:
# import pandas as pd

# Read the transactions data from the CSV file
file_path = 'transactions.csv'
df = pd.read_csv(file_path)

# Drop the first row permanently
df.drop(index=0, inplace=True)

# Drop the "date" column without modifying the original DataFrame
df_without_date = df.drop(columns=['date'])

# Get a DataFrame with only the last row for each store
last_row_per_store = df.groupby('store_nbr').last().reset_index()

# Display the modified DataFrame without the first row and without the "date" column
print("DataFrame without the first row and without the 'date' column:")
print(df_without_date)

# Display the DataFrame with only the last row for each store
print("\nDataFrame with only the last row for each store:")
print(last_row_per_store)

DataFrame without the first row and without the 'date' column:
       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

DataFrame with only the last row for each store:
    store_nbr        date  transactions
0           1  2017-08-15          1693
1           2  2017-08-15          1737
2           3  2017-08-15          2956
3           4  2017-08-15          1283
4           5  2017-08-15          1310
5           6  2017-08-15          1589
6           7  2017-08-15          1780
7           8  2017-08-15          2621
8           9  2017-08-15          2155
9          10  2017-08-15          1010
10         11  2017-08-15          2360
11         12  2017-08-15          1096
12         13  2017-08-15           842
13         14  2017-08-15          1241
14         15  2017-08-15          1320
15         16  2017-08-15           742
16         17  2017-08-15          1504
17         18  2017-08-15          1343
18         19  2017-08-15          1158
19         20  2017-08-15          1516
20         21  2017-08-15          1059
21         22  2017-08-15           766
22         23  2017-08-15           946
23         24  2017-08-15          2138
24         25  2017-08-15           849
25         26  2017-08-15           534
26         27  2017-08-15          1543
27         28  2017-08-15          1343
28         29  2017-08-15          1302
29         30  2017-08-15           825
30         31  2017-08-15          1360
31         32  2017-08-15           615
32         33  2017-08-15           919
33         34  2017-08-15          2007
34         35  2017-08-15           612
35         36  2017-08-15          1192
36         37  2017-08-15          1373
37         38  2017-08-15          1445
38         39  2017-08-15          1425
39         40  2017-08-15          1392
40         41  2017-08-15          1003
41         42  2017-08-15           995
42         43  2017-08-15          1482
43         44  2017-08-15          3815
44         45  2017-08-15          3685
45         46  2017-08-15          3197
46         47  2017-08-15          3581
47         48  2017-08-15          2722
48         49  2017-08-15          2814
49         50  2017-08-15          2804
50         51  2017-08-15          1573
51         52  2017-08-15          2255
52         53  2017-08-15           932
53         54  2017-08-15           802

# Handling Missing Data

# Task # oil data - 'data/retail/oil.csv'

In [99]:
import pandas as pd
import numpy as np

# Assuming oil_prices_df is your DataFrame with columns 'date' and 'price'
# Replace this with your actual DataFrame
oil_prices_df = pd.DataFrame({'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-05'],
                              'price': [50.0, 51.44, 47.83, np.nan]})

# Check for missing values in the 'date' and 'price' columns
missing_dates = pd.date_range(start=oil_prices_df['date'].min(), end=oil_prices_df['date'].max()).difference(pd.to_datetime(oil_prices_df['date']))
missing_prices = oil_prices_df['price'].isnull().any()

# Display missing dates and prices
print(f"Missing dates: {missing_dates.to_list()}")
print(f"Missing prices: {missing_prices}")

# Fill missing prices with 0 and calculate mean
mean_with_zero = oil_prices_df['price'].fillna(0).mean()

# Fill missing prices with the mean and calculate mean
mean_with_mean = oil_prices_df['price'].fillna(oil_prices_df['price'].mean()).mean()

# Display the mean oil prices for both scenarios
print(f"\nMean oil price with missing values filled with 0: {mean_with_zero:.2f}")
print(f"Mean oil price with missing values filled with the mean: {mean_with_mean:.2f}")

Missing dates: [Timestamp('2022-01-04 00:00:00')]
Missing prices: True

Mean oil price with missing values filled with 0: 37.32
Mean oil price with missing values filled with the mean: 49.76

In [100]:
oil_df = pd.read_csv('oil.csv')
oil_df

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [101]:
oil_df.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [102]:
oil_df["dcoilwtico"].fillna(0).mean()

65.32379310344828

In [103]:
oil_df["dcoilwtico"].fillna(oil_df["dcoilwtico"].mean()).mean()

67.71436595744682

# Sorting & Filtering

# Task - Dataset: Transactions 'data/retail/transactions.csv'

In [105]:
import pandas as pd

# Assuming df is your DataFrame with columns 'store_nbr' and 'transactions'
# Replace this with your actual DataFrame
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05'],
        'store_nbr': [1, 1, 2, 25, 3],
        'transactions': [1500, 2100, 1800, 2200, 1900]}
df = pd.DataFrame(data)

# Convert 'date' to datetime format
df['date'] = pd.to_datetime(df['date'])

# Task 1: Percentage of times ALL stores had more than 2000 transactions
all_stores_more_than_2000 = df.groupby('date')['transactions'].apply(lambda x: all(x > 2000)).mean() * 100

# Task 2: Percentage of times store 25 had more than 2000 transactions and sum of transactions on these days
store_25_more_than_2000 = df[df['store_nbr'] == 25]
percentage_store_25_more_than_2000 = (store_25_more_than_2000['transactions'] > 2000).mean() * 100
sum_transactions_store_25_more_than_2000 = store_25_more_than_2000['transactions'].sum()

# Task 3: Sum transactions for stores 25 and 3 in May or June with less than 2000 transactions
filtered_data = df[(df['store_nbr'].isin([25, 3])) & (df['date'].dt.month.isin([5, 6])) & (df['transactions'] < 2000)]
sum_transactions_stores_25_3_may_june = filtered_data['transactions'].sum()

# Display results
print(f"Task 1: Percentage of times ALL stores had more than 2000 transactions: {all_stores_more_than_2000:.2f}%")
print(f"Task 2: Percentage of times store 25 had more than 2000 transactions: {percentage_store_25_more_than_2000:.2f}%")
print(f"        Sum of transactions on these days for store 25: {sum_transactions_store_25_more_than_2000}")
print(f"Task 3: Sum transactions for stores 25 and 3 in May or June with less than 2000 transactions: {sum_transactions_stores_25_3_may_june}")

Task 1: Percentage of times ALL stores had more than 2000 transactions: 40.00%
Task 2: Percentage of times store 25 had more than 2000 transactions: 100.00%
        Sum of transactions on these days for store 25: 2200
Task 3: Sum transactions for stores 25 and 3 in May or June with less than 2000 transactions: 0

# Task - Dataset: Transactions 'data/retail/transactions.csv'

In [106]:
import pandas as pd

# Assuming df is your DataFrame with columns 'date' and 'transactions'
# Replace this with your actual DataFrame
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05'],
        'transactions': [1500, 2100, 1800, 2200, 1900]}
df = pd.DataFrame(data)

# Convert 'date' to datetime format
df['date'] = pd.to_datetime(df['date'])

# Task 1: Get a dataset that includes the 5 days with the highest transactions counts
top_5_days = df.nlargest(5, 'transactions')

# Task 2: Get a dataset sorted by date from earliest to most recent, 
# with the highest transactions first and the lowest transactions last for each day
sorted_by_date = df.sort_values(by=['date', 'transactions'], ascending=[True, False])

# Task 3: Sort the columns in reverse alphabetical order
reverse_alphabetical_order = df[sorted(df.columns, reverse=True)]

# Display results
print("Task 1: Dataset with the 5 days with the highest transactions counts:")
print(top_5_days)

print("\nTask 2: Dataset sorted by date with the highest transactions first and lowest transactions last for each day:")
print(sorted_by_date)

print("\nTask 3: Dataset with columns sorted in reverse alphabetical order:")
print(reverse_alphabetical_order)

Task 1: Dataset with the 5 days with the highest transactions counts:
        date  transactions
3 2022-01-04          2200
1 2022-01-02          2100
4 2022-01-05          1900
2 2022-01-03          1800
0 2022-01-01          1500

Task 2: Dataset sorted by date with the highest transactions first and lowest transactions last for each day:
        date  transactions
0 2022-01-01          1500
1 2022-01-02          2100
2 2022-01-03          1800
3 2022-01-04          2200
4 2022-01-05          1900

Task 3: Dataset with columns sorted in reverse alphabetical order:
   transactions       date
0          1500 2022-01-01
1          2100 2022-01-02
2          1800 2022-01-03
3          2200 2022-01-04
4          1900 2022-01-05

# Modifying Columns

# Task - Dataset: Transactions 'data/retail/transactions.csv'

In [107]:
import pandas as pd

# Assuming df is your DataFrame with columns 'date', 'transactions', and 'store_nbr'
# Replace this with your actual DataFrame
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03'],
        'transactions': [1500, 2100, 1800],
        'store_nbr': [1, 2, 3]}
df = pd.DataFrame(data)

# Rename columns
df = df.rename(columns={'transactions': 'transaction_count', 'store_nbr': 'store_number'})

# Reorder columns
df = df[['date', 'transaction_count', 'store_number']]

# Display the DataFrame with renamed and reordered columns
print(df)

         date  transaction_count  store_number
0  2022-01-01               1500             1
1  2022-01-02               2100             2
2  2022-01-03               1800             3

# Task - Dataset: Transactions 'data/retail/transactions.csv'

In [108]:
import pandas as pd

# Assuming df is your DataFrame with columns 'date' and 'transactions'
# Replace this with your actual DataFrame
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03'],
        'transactions': [1500, 2100, 1800]}
df = pd.DataFrame(data)

# Convert 'date' to datetime format
df['date'] = pd.to_datetime(df['date'])

# Create 'pct_to_target' column
df['pct_to_target'] = df['transactions'] / 2500

# Create 'met_target' column
df['met_target'] = df['pct_to_target'] >= 1

# Create 'bonus_payable' column
df['bonus_payable'] = df['met_target'].apply(lambda x: 100 if x else 0)

# Sum the total 'bonus_payable' amount
total_bonus_payable = df['bonus_payable'].sum()

# Create columns for month and day of week as integers
df['month'] = df['date'].dt.month
df['day_of_week'] = df['date'].dt.dayofweek

# Display the DataFrame with the new columns
print(df)

# Display the total 'bonus_payable' amount
print(f"\nTotal bonus payable: {total_bonus_payable}")

        date  transactions  pct_to_target  met_target  bonus_payable  month  \
0 2022-01-01          1500           0.60       False              0      1
1 2022-01-02          2100           0.84       False              0      1
2 2022-01-03          1800           0.72       False              0      1

   day_of_week
0            5
1            6
2            0

Total bonus payable: 0

# Mapping values to columns

# Task - Dataset: Transactions 'data/retail/transactions.csv'

In [109]:
import pandas as pd

# Assuming df is your DataFrame with columns 'date', 'transaction_count', and 'store_number'
# Replace this with your actual DataFrame
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03'],
        'transaction_count': [1500, 2100, 1800],
        'store_number': [1, 2, 3]}
df = pd.DataFrame(data)

# Convert 'date' to datetime format
df['date'] = pd.to_datetime(df['date'])

# Drop the columns created so far
df = df[['date', 'store_number', 'transaction_count']]

# Recreate the columns using the assign method
df = df.assign(
    pct_to_target=df['transaction_count'] / 2500,
    met_target=(df['transaction_count'] / 2500 >= 1),
    bonus_payable=df['transaction_count'].apply(lambda x: 100 if x / 2500 >= 1 else 0),
    month=df['date'].dt.month,
    day_of_week=df['date'].dt.dayofweek
)

# Sum the total 'bonus_payable' amount
total_bonus_payable = df['bonus_payable'].sum()

# Display the DataFrame with the recreated columns
print(df)

# Display the total 'bonus_payable' amount
print(f"\nTotal bonus payable: {total_bonus_payable}")

        date  store_number  transaction_count  pct_to_target  met_target  \
0 2022-01-01             1               1500           0.60       False
1 2022-01-02             2               2100           0.84       False
2 2022-01-03             3               1800           0.72       False

   bonus_payable  month  day_of_week
0              0      1            5
1              0      1            6
2              0      1            0

Total bonus payable: 0

# Memory Optimization

# Task Dataset: 'data/retail/transactions.csv'

In [111]:
import pandas as pd

# Assuming df is your DataFrame
# Replace this with your actual DataFrame
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03'],
        'transaction_count': [1500, 2100, 1800],
        'store_number': [1, 2, 3]}
df = pd.DataFrame(data)

# Convert 'date' to datetime format and downcast to categorical type
df['date'] = pd.to_datetime(df['date']).astype('category')

# Convert other numeric columns to appropriate types
df['transaction_count'] = pd.to_numeric(df['transaction_count'], downcast='integer')
df['store_number'] = pd.to_numeric(df['store_number'], downcast='integer')

# Display the DataFrame info to check memory usage
print(df.info(memory_usage='deep'))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   date               3 non-null      category
 1   transaction_count  3 non-null      int16
 2   store_number       3 non-null      int8
dtypes: category(1), int16(1), int8(1)
memory usage: 276.0 bytes
None

In [112]:
import numpy as np
import pandas as pd

# Grouping

# Task

In [113]:
import pandas as pd

# Assuming df is your DataFrame with columns 'store_number' and 'transaction_count'
# Replace this with your actual DataFrame
data = {'store_number': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
        'transaction_count': [1500, 2100, 1800, 2200, 1900, 2000, 2300, 2500, 2400, 2000, 2100]}
df = pd.DataFrame(data)

# Group by 'store_number' and calculate total transactions for each store
total_transactions_by_store = df.groupby('store_number')['transaction_count'].sum()

# Get the top 10 stores by total transactions, sorted from highest to lowest
top_10_stores = total_transactions_by_store.nlargest(10).reset_index()

top_10_stores

   store_number  transaction_count
0             8               2500
1             9               2400
2             7               2300
3             4               2200
4             2               2100
5            11               2100
6             6               2000
7            10               2000
8             5               1900
9             3               1800

In [114]:
transaction_df = pd.read_csv("transactions.csv")
transaction_df

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [115]:
transaction_df.groupby('store_nbr')[['transactions']].sum().sort_values(by='transactions', ascending=False).iloc[:10]

           transactions
store_nbr
44              7273093
47              6535810
45              6201115
46              5990113
3               5366350
48              5107785
8               4637971
49              4574103
50              4384444
11              3972488

# Task

In [116]:
import pandas as pd

# Assuming df is your DataFrame with columns 'date', 'store_number', and 'transaction_count'
# Replace this with your actual DataFrame
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-02-01', '2022-02-02', '2022-02-03'],
        'store_number': [1, 2, 3, 1, 2, 3],
        'transaction_count': [1500, 2100, 1800, 2200, 1900, 2000]}
df = pd.DataFrame(data)

# Convert 'date' to datetime format
df['date'] = pd.to_datetime(df['date'])

# Extract month and year from 'date'
df['month'] = df['date'].dt.month
df['year'] = df['date'].dt.year

# Group by 'year', 'month', and 'store_number' and calculate total transactions for each store and month
total_transactions_by_store_month = df.groupby(['year', 'month', 'store_number'])['transaction_count'].sum()

# Sort the table by first month to last, then by highest transactions to lowest within each month
sorted_table = total_transactions_by_store_month.reset_index().sort_values(by=['year', 'month', 'transaction_count'], ascending=[True, True, False])

# Display the sorted table
print(sorted_table)

   year  month  store_number  transaction_count
1  2022      1             2               2100
2  2022      1             3               1800
0  2022      1             1               1500
3  2022      2             1               2200
5  2022      2             3               2000
4  2022      2             2               1900

# Multi-Index

# Task

In [119]:
import pandas as pd

# Sample DataFrame with MultiIndex
data = {'transactions': [1500, 2100, 1800, 2200, 1900, 2000],
        'bonus_payable': [0, 100, 0, 100, 0, 100]}
index = pd.MultiIndex.from_tuples([(1, 1), (2, 1), (3, 1), (1, 2), (2, 2), (3, 2)], names=['store_number', 'month'])
df = pd.DataFrame(data, index=index)

# Display the sample DataFrame
print("Original DataFrame:")
print(df)
print()

# Access Store 3, Month 1 and select the column storing the mean of transactions
store_3_month_1 = df.loc[(3, 1), 'transactions']

# Display the result
print("Access Store 3, Month 1 and select the column storing the mean of transactions:")
print(store_3_month_1)
print()

# Reset the row index to default integer index and reset column names
df.reset_index(inplace=True)
df.columns.name = None

# Display the DataFrame after fixing the structure
print("DataFrame after fixing the structure:")
print(df)

Original DataFrame:
                    transactions  bonus_payable
store_number month
1            1              1500              0
2            1              2100            100
3            1              1800              0
1            2              2200            100
2            2              1900              0
3            2              2000            100

Access Store 3, Month 1 and select the column storing the mean of transactions:
1800

DataFrame after fixing the structure:
   store_number  month  transactions  bonus_payable
0             1      1          1500              0
1             2      1          2100            100
2             3      1          1800              0
3             1      2          2200            100
4             2      2          1900              0
5             3      2          2000            100

In [120]:
# Read in transactions data -- parse dates specified here for help with later problem

transactions = pd.read_csv("transactions.csv", parse_dates=["date"])

transactions.head()

        date  store_nbr  transactions
0 2013-01-01         25           770
1 2013-01-02          1          2111
2 2013-01-02          2          2358
3 2013-01-02          3          3487
4 2013-01-02          4          1922

In [121]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [122]:
transactions["month"] = transactions["date"].dt.month
transactions

            date  store_nbr  transactions  month
0     2013-01-01         25           770      1
1     2013-01-02          1          2111      1
2     2013-01-02          2          2358      1
3     2013-01-02          3          3487      1
4     2013-01-02          4          1922      1
...          ...        ...           ...    ...
83483 2017-08-15         50          2804      8
83484 2017-08-15         51          1573      8
83485 2017-08-15         52          2255      8
83486 2017-08-15         53           932      8
83487 2017-08-15         54           802      8

[83488 rows x 4 columns]

In [123]:
grouped = (
    transactions.groupby(["store_nbr", "month"])
    .agg({"transactions": ["sum", "mean"]})
    .sort_values(by=["month", ("transactions", "sum")], ascending=[True, False])
)
grouped

                transactions
                         sum         mean
store_nbr month
44        1           628438  4246.202703
47        1           568824  3843.405405
45        1           538370  3637.635135
46        1           522763  3532.182432
3         1           463260  3151.428571
...                      ...          ...
32        12           86167   718.058333
21        12           84128  1402.133333
42        12           76741  1279.016667
29        12           76627  1277.116667
22        12           50650   844.166667

[641 rows x 2 columns]

In [124]:
# Grab store 3, month 1 from multi-index (both values are integers)
grouped.loc[(3,1), :]

transactions  sum     463260.000000
              mean      3151.428571
Name: (3, 1), dtype: float64

In [125]:
# Grab mean column in column multi-index
grouped.loc[: , [('transactions', 'mean')]]

                transactions
                        mean
store_nbr month
44        1      4246.202703
47        1      3843.405405
45        1      3637.635135
46        1      3532.182432
3         1      3151.428571
...                      ...
32        12      718.058333
21        12     1402.133333
42        12     1279.016667
29        12     1277.116667
22        12      844.166667

[641 rows x 1 columns]

In [126]:
# Drop level from column index (axis=1), then reset index
grouped.reset_index().droplevel(0, axis=1)

                sum         mean
0    44   1  628438  4246.202703
1    47   1  568824  3843.405405
2    45   1  538370  3637.635135
3    46   1  522763  3532.182432
4     3   1  463260  3151.428571
..   ..  ..     ...          ...
636  32  12   86167   718.058333
637  21  12   84128  1402.133333
638  42  12   76741  1279.016667
639  29  12   76627  1277.116667
640  22  12   50650   844.166667

[641 rows x 4 columns]

# Agg Method on Multi-index

# Task

In [131]:
import pandas as pd

# Assuming df is your DataFrame with columns 'store_number', 'target_met', 'bonus_payable', and 'date'
# Replace this with your actual DataFrame
data = {'store_number': [1, 2, 3, 4, 5, 6],
        'target_met': [True, False, True, False, True, True],
        'bonus_payable': [100, 50, 80, 30, 120, 90],
        'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-02-01', '2022-02-02', '2022-02-03']}
df = pd.DataFrame(data)

# Convert 'date' to datetime format
df['date'] = pd.to_datetime(df['date'])

# Extract day of the week
df['day_of_week'] = df['date'].dt.dayofweek

# Calculate the mean of target met by store
mean_target_met_by_store = df.groupby('store_number')['target_met'].mean()

# Calculate the sum of bonuses to be paid to each store
sum_bonuses_by_store = df.groupby('store_number')['bonus_payable'].sum()

# Create a DataFrame with the results for stores
store_results = pd.DataFrame({
    'mean_target_met': mean_target_met_by_store,
    'sum_bonuses': sum_bonuses_by_store
})

# Sort by highest to lowest bonus payout
store_results_sorted = store_results.sort_values(by='sum_bonuses', ascending=False)

# Display the results for stores
print("Results for stores:")
print(store_results_sorted)
print()

# Calculate the mean of target met by day of week
mean_target_met_by_day_of_week = df.groupby('day_of_week')['target_met'].mean()

# Calculate the sum of bonuses to be paid by day of week
sum_bonuses_by_day_of_week = df.groupby('day_of_week')['bonus_payable'].sum()

# Create a DataFrame with the results for day of week
day_of_week_results = pd.DataFrame({
    'mean_target_met': mean_target_met_by_day_of_week,
    'sum_bonuses': sum_bonuses_by_day_of_week
})

# Sort by highest to lowest bonus payout
day_of_week_results_sorted = day_of_week_results.sort_values(by='sum_bonuses', ascending=False)

# Display the results for day of week
print("Results for day of week:")
print(day_of_week_results_sorted)
print()

# Calculate the mean of target met by month
mean_target_met_by_month = df.groupby(df['date'].dt.month)['target_met'].mean()

# Calculate the sum of bonuses to be paid by month
sum_bonuses_by_month = df.groupby(df['date'].dt.month)['bonus_payable'].sum()

# Create a DataFrame with the results for month
month_results = pd.DataFrame({
    'mean_target_met': mean_target_met_by_month,
    'sum_bonuses': sum_bonuses_by_month
})

# Sort by highest to lowest bonus payout
month_results_sorted = month_results.sort_values(by='sum_bonuses', ascending=False)

# Display the results for month
print("Results for month:")
print(month_results_sorted)

Results for stores:
              mean_target_met  sum_bonuses
store_number
5                         1.0          120
1                         1.0          100
6                         1.0           90
3                         1.0           80
2                         0.0           50
4                         0.0           30

Results for day of week:
             mean_target_met  sum_bonuses
day_of_week
2                        1.0          120
5                        1.0          100
3                        1.0           90
0                        1.0           80
6                        0.0           50
1                        0.0           30

Results for month:
      mean_target_met  sum_bonuses
date
2            0.666667          240
1            0.666667          230

In [128]:
# Recreate table from section 3

transactions = transactions.assign(
    target_pct=transactions["transactions"] / 2500,
    met_target=(transactions["transactions"] / 2500) >= 1,
    bonus_payable=((transactions["transactions"] / 2500) >= 1) * 100,
    month=transactions.date.dt.month,
    day_of_week=transactions.date.dt.dayofweek,
)

transactions.head()

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week
0,2013-01-01,25,770,1,0.3080,False,0,1
1,2013-01-02,1,2111,1,0.8444,False,0,2
2,2013-01-02,2,2358,1,0.9432,False,0,2
3,2013-01-02,3,3487,1,1.3948,True,100,2
4,2013-01-02,4,1922,1,0.7688,False,0,2

In [132]:
import pandas as pd

# Assuming df is your DataFrame with columns 'store_number', 'met_target', 'transactions', and 'bonus_payable'
# Replace this with your actual DataFrame
data = {'store_number': [1, 2, 3, 1, 2, 3],
        'met_target': [1, 0, 1, 0, 1, 1],
        'transactions': [1500, 2100, 1800, 2200, 1900, 2000],
        'bonus_payable': [100, 50, 80, 30, 120, 90]}
df = pd.DataFrame(data)

# Group transactions by store number and calculate store level stats
store_stats = df.groupby('store_number').agg(
    mean_met_target=('met_target', 'mean'),
    sum_transactions=('transactions', 'sum'),
    sum_bonus_payable=('bonus_payable', 'sum')
)

# Sort values by bonus payable in descending order
store_stats_sorted = store_stats.sort_values(by='sum_bonus_payable', ascending=False)

# Display the store level stats sorted by bonus payable
print("Store level stats sorted by bonus payable:")
print(store_stats_sorted)

Store level stats sorted by bonus payable:
              mean_met_target  sum_transactions  sum_bonus_payable
store_number
2                         0.5              4000                170
3                         1.0              3800                170
1                         0.5              3700                130

In [133]:
import pandas as pd

# Assuming df is your DataFrame with columns 'month', 'met_target', 'transactions', and 'bonus_payable'
# Replace this with your actual DataFrame
data = {'month': [1, 1, 1, 2, 2, 2],
        'met_target': [1, 0, 1, 0, 1, 1],
        'transactions': [1500, 2100, 1800, 2200, 1900, 2000],
        'bonus_payable': [100, 50, 80, 30, 120, 90]}
df = pd.DataFrame(data)

# Group transactions by month and calculate month level stats
month_stats = df.groupby('month').agg(
    mean_met_target=('met_target', 'mean'),
    sum_transactions=('transactions', 'sum'),
    sum_bonus_payable=('bonus_payable', 'sum')
)

# Sort values by bonus payable in descending order
month_stats_sorted = month_stats.sort_values(by='sum_bonus_payable', ascending=False)

# Display the month level stats sorted by bonus payable
print("Month level stats sorted by bonus payable:")
print(month_stats_sorted)

Month level stats sorted by bonus payable:
       mean_met_target  sum_transactions  sum_bonus_payable
month
2             0.666667              6100                240
1             0.666667              5400                230

In [134]:
import pandas as pd

# Assuming df is your DataFrame with columns 'day_of_week', 'met_target', 'transactions', and 'bonus_payable'
# Replace this with your actual DataFrame
data = {'day_of_week': [0, 1, 2, 0, 1, 2],
        'met_target': [1, 0, 1, 0, 1, 1],
        'transactions': [1500, 2100, 1800, 2200, 1900, 2000],
        'bonus_payable': [100, 50, 80, 30, 120, 90]}
df = pd.DataFrame(data)

# Group transactions by day of the week and calculate day-of-week level stats
day_of_week_stats = df.groupby('day_of_week').agg(
    mean_met_target=('met_target', 'mean'),
    sum_transactions=('transactions', 'sum'),
    sum_bonus_payable=('bonus_payable', 'sum')
)

# Sort values by bonus payable in descending order
day_of_week_stats_sorted = day_of_week_stats.sort_values(by='sum_bonus_payable', ascending=False)

# Display the day-of-week level stats sorted by bonus payable
print("Day-of-week level stats sorted by bonus payable:")
print(day_of_week_stats_sorted)

Day-of-week level stats sorted by bonus payable:
             mean_met_target  sum_transactions  sum_bonus_payable
day_of_week
1                        0.5              4000                170
2                        1.0              3800                170
0                        0.5              3700                130

# Transform

# Task

In [135]:
import pandas as pd

# Assuming df is your DataFrame with columns 'store_number' and 'transactions'
# Replace this with your actual DataFrame
data = {'store_number': [1, 2, 3, 1, 2, 3],
        'transactions': [1500, 2100, 1800, 2200, 1900, 2000]}
df = pd.DataFrame(data)

# Calculate the average transactions for each store without losing rows
df['average_transactions'] = df.groupby('store_number')['transactions'].transform('mean')

# Create a new column for the difference between store's average and transactions on that day
df['difference'] = df['average_transactions'] - df['transactions']

# Display the DataFrame with the new columns
print("DataFrame with new columns:")
print(df)

DataFrame with new columns:
   store_number  transactions  average_transactions  difference
0             1          1500                1850.0       350.0
1             2          2100                2000.0      -100.0
2             3          1800                1900.0       100.0
3             1          2200                1850.0      -350.0
4             2          1900                2000.0       100.0
5             3          2000                1900.0      -100.0

# Pivot Table